tap "1password/tap"
tap "fnando/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "sergiobenitez/osxct"
tap "sidneys/homebrew"
tap "stripe/stripe-cli"
# Run your GitHub Actions locally
brew "act"
# Library for manipulating PNG images
brew "libpng"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Parser generator
brew "bison"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy", restart_service: true
# Software library to render fonts
brew "freetype"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Isolated development environments using Docker
brew "docker-compose"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Improved colored diff
brew "icdiff"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNOME XML library
brew "libxml2"
# Image processing library
brew "vips"
# Fast and secure server for resizing and converting remote images
brew "imgproxy"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# High performance, distributed memory object caching system
brew "memcached"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# PNG image optimizing utility
brew "pngquant"
# Object-relational database system
brew "postgresql@17", restart_service: true, link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# HTTP regression testing and benchmarking utility
brew "siege"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Cross-shell prompt for astronauts
brew "starship"
# Stellar command-line tool for interacting with the Stellar network
brew "stellar-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# A prettier terminal's ls command, with color and https://www.nerdfonts.com/ icons.
brew "fnando/tap/ll"
# A command-line tool to retrieve secrets from 1Password, with custom output to several formats. Depends on 1Password's own `op` command.
brew "fnando/tap/op-env"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Application launcher and productivity software
cask "alfred"
# Tool to uninstall unwanted applications and their support files
cask "appzapper"
# Menu bar icon organiser
cask "bartender"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Application window manager focusing on simplicity
cask "divvy"
# App to build and share containerised applications and microservices
cask "docker"
# Tool to turn a website into a desktop app
cask "fluid"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Retro video game emulation
cask "openemu"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Text editor for code, markup and prose
cask "sublime-text"
# Unpacks archive files
cask "the-unarchiver"
# Multimedia player
cask "vlc"
# Alternative and privacy-friendly YouTube frontend
cask "yattee"
