tap "1password/tap"
tap "akeru-inc/tap"
tap "amiaopensource/amiaos"
tap "aws/tap"
tap "cdalvaro/tap"
tap "cloudflare/cloudflare"
tap "codeclimate/formulae"
tap "fermyon/tap"
tap "fnando/tap"
tap "gobuffalo/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "jonof/kenutils"
tap "pls-rs/pls"
tap "puma/puma"
tap "russellbanks/tap"
tap "sergiobenitez/osxct"
tap "sidneys/homebrew"
tap "stellar/tap"
tap "stripe/stripe-cli"
tap "wix/brew"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Recompression utilities for .PNG, .MNG, .ZIP, and .GZ files
brew "advancecomp"
# Library for manipulating PNG images
brew "libpng"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU compiler collection
brew "gcc"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Audio codec
brew "opus"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Extract annotations from audio signals
brew "aubio"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Freely available high-quality data compressor
brew "bzip2"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy", restart_service: true
# Cargo subcommand for displaying when Rust dependencies are out of date
brew "cargo-outdated"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Minimalistic plugin API for video effects
brew "frei0r"
# Asynchronous event library
brew "libevent"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# NaCl networking and cryptography library
brew "libsodium"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Framework for layout and rendering of i18n text
brew "pango"
# Fastest and safest AV1 video encoder
brew "rav1e"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Core component of the AcoustID project (Audio fingerprinting)
brew "chromaprint"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Unit testing framework for C
brew "cmocka"
# Music player with an ncurses based interface
brew "cmus"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# Like tail(1), but with various colors for specified output
brew "colortail"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Unit testing framework handling automated tests in C++
brew "cpptest"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Isolated development environments using Docker
brew "docker-compose"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Validate EPUB files, version 2.0 and later
brew "epubcheck"
# Extremely fast JavaScript bundler and minifier
brew "esbuild"
# Text to speech, software speech synthesizer
brew "espeak"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# ISO AAC audio encoder
brew "faac"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Library for FreeImage, a dependency-free graphics library
brew "freeimage"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Platform built on V8 to build network applications
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU grep, egrep and fgrep
brew "grep"
# Fulltext search engine and column store
brew "groonga"
# Library for reading and writing H264 video streams
brew "h264bitstream"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# File format designed to store large amounts of data
brew "hdf5"
# Advanced HTML-to-text converter
brew "html2text"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Improved colored diff
brew "icdiff"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# EXIF parsing library
brew "libexif"
# Library to render SVG files using Cairo
brew "librsvg"
# Libraries for security-enabled client and server applications
brew "nss"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Image processing library
brew "vips"
# Fast and secure server for resizing and converting remote images
brew "imgproxy"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Modular IRC client
brew "irssi"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Image manipulation library
brew "jpeg"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Implementations for atomic memory update operations
brew "libatomic_ops"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# Implementation of the file(1) command
brew "libmagic"
# Extensible, open standard container format for audio/video
brew "libmatroska"
# VisualOn AAC encoder library
brew "libvo-aacenc"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Creates dependencies in makefiles
brew "makedepend"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# High performance, distributed memory object caching system
brew "memcached"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# QUIC transport protocol implementation
brew "mvfst"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# PNG file optimizer
brew "optipng"
# Oil Runtime Compiler (ORC)
brew "orc"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Multithreaded PNG optimizer written in Rust
brew "oxipng"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# General-purpose scripting language
brew "php@8.1"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Optimizer for PNG files
brew "pngcrush"
# PNG image optimizing utility
brew "pngquant"
# Object-relational database system
brew "postgresql@17", restart_service: true, link: true
# Convert bitmaps to vector graphics
brew "potrace"
# Pretty-print tabular data in Python
brew "python-tabulate"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# Sampling profiler for Ruby
brew "rbspy"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Ruby autoformatter
brew "rubyfmt"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# High-speed implementation of the Dirac codec
brew "schroedinger"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# SDL 1.2 compatibility layer that uses SDL 2.0 behind the scenes
brew "sdl12-compat"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# HTTP regression testing and benchmarking utility
brew "siege"
# SOund eXchange: universal sound sample translator
brew "sox"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Stellar command-line tool for interacting with the Stellar network
brew "stellar-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Program that allows you to count code, quickly
brew "tokei"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Compress/expand executable files
brew "upx"
# URI parsing library (strictly RFC 3986 compliant)
brew "uriparser"
# Syntax-aware linter for prose
brew "vale"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Linter for YAML files
brew "yamllint"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Flexible and fast Zsh plugin manager
brew "zinit"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# macOS app notarization helper
brew "akeru-inc/tap/xcnotary"
# Open-source tool for building and running serverless WebAssembly applications
brew "fermyon/tap/spin"
# A prettier terminal's ls command, with color and https://www.nerdfonts.com/ icons.
brew "fnando/tap/ll"
# A command-line tool to retrieve secrets from 1Password, with custom output to several formats. Depends on 1Password's own `op` command.
brew "fnando/tap/op-env"
brew "gobuffalo/tap/buffalo"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Ken Silverman's PNG optimisation utility
brew "jonof/kenutils/pngout"
# Komac - Community Manifest Creator for Windows Package Manager (WinGet)
brew "russellbanks/tap/komac"
# x86_64 Linux GNU Toolchain
brew "sergiobenitez/osxct/x86_64-unknown-linux-gnu"
# Extract, view, and test RAR archives
brew "sidneys/homebrew/unrar"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Apple simulator utilities
brew "wix/brew/applesimutils"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# User-friendly GUI app for Homebrew
cask "applite"
# Tool to uninstall unwanted applications and their support files
cask "appzapper"
# Menu bar icon organiser
cask "bartender"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Application window manager focusing on simplicity
cask "divvy"
# App to build and share containerised applications and microservices
cask "docker"
# Dreamcast, Naomi and Atomiswave emulator
cask "flycast"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Music tagger
cask "musicbrainz-picard"
# Retro video game emulation
cask "openemu"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Native GUI tool for relational databases
cask "tableplus"
# Unpacks archive files
cask "the-unarchiver"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Alternative and privacy-friendly YouTube frontend
cask "yattee"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
